{"data":{"site":{"siteMetadata":{"title":"Blog by NSA94","subtitle":"Coder | Tech Enthusiast | Future Software Engineer | Comic Lover","copyright":"© All rights reserved.","author":{"name":"Nuwan Sameera Alawatta","twitter":"_nsa94"},"disqusShortname":"","url":"https://nuwan.dev/blog"}},"markdownRemark":{"id":"36518b44-f09e-5a9e-b652-b086633d24f8","html":"<p>As students we all like to learn new technologies, love to work on different platforms and improve our knowledge and gaining experience which we cannot get during the lectures in university. Unfortunately most of the services, tools, platforms are expensive and the undergraduate may not able to afford those.</p>\n<p>But luckily, there are some awesome companies that think about this problem and giveaway their products &#x26; services FREE for any university student while they are in university.</p>\n<h2>Requirements</h2>\n<p>For applying these offers you must have a email address given by university. Most of the time its a academic email that have <code class=\"language-text\">.ac</code> (academic) or <code class=\"language-text\">.edu</code> (educational) sub-domain/domain.</p>\n<p>Example : <code class=\"language-text\">username@stu.kln.ac.lk</code> (Kelani Mail for University of Kelaniya Students)</p>\n<p>If you don’t have university email please try to get one by contacting IT center of your university. However some offers can be get without this email, but you may need to send some documents and emails to prove that you’re a university student.</p>\n<p>Now let’s find more about currently available students offers and their benefits.</p>\n<h2>GitHub Student Pack</h2>\n<p>GitHub offers number of tools and services to the students in their student packs. It includes</p>\n<ul>\n<li>PRO GitHub account that have unlimited private repositories, unlimited collaborators for projects</li>\n<li>$50 in platform credit for DigitalOcean</li>\n<li>One free Hobby Dyno in Heroku</li>\n<li>JetBrains Developer pack</li>\n<li>One year domain name registration on the .me TLD in NameCheap.com</li>\n</ul>\n<p>and many more. Get it from below link.</p>\n<p>LINK : <a href=\"https://education.github.com/pack\">https://education.github.com/pack</a></p>\n<h2>JetBrains for Students</h2>\n<p>JetBrains offer their all the IDEs and tools 100% FREE for the university students while they are in university. These products comes with all the premium features that you cannot find in the community versions.</p>\n<p>PS : If you already have GitHub Student Pack you can directly apply for the JetBrains License in your <a href=\"https://education.github.com/pack/offers\">GitHub Student Pack Page</a>.</p>\n<p>LINK : <a href=\"https://education.github.com/pack/offers\">https://education.github.com/pack/offers</a></p>\n<h2>Office 365</h2>\n<p>Microsoft giveaway their Office 365 cloud and offline versions free for the students while they have access to university email.</p>\n<p>LINK : <a href=\"https://www.microsoft.com/en-us/education/products/office\">https://www.microsoft.com/en-us/education/products/office</a></p>\n<p>That’s all for now. I’ll update the article continuously with latest offers available.</p>","fields":{"tagSlugs":["/tags/free/","/tags/university/","/tags/giveaway/"]},"frontmatter":{"title":"Be a Pro-Student","tags":["Free","University","Giveaway"],"date":"2018-10-18T16:51:00.000Z","description":"This starter has been forked and upgraded to Gatsby v2"}}},"pageContext":{"slug":"/posts/be-a-pro-student/"}}